// Напишите программу, которая отображает имя в прямоугольнике из символов, выбранных пользователем.
Программа должна запрашивать у пользователя символ для создания прямоугольника и само имя, которое нужно отобразить внутри этого прямоугольника. Затем выводите имя в прямоугольнике из указанного символа.
Длина всех строк в прямоугольнике должна быть одинаковой. Чтобы определить эту длину, можно использовать длину строки, содержащей имя, плюс две дополнительные позиции для символов по краям. Например, если пользователь вводит символ % и имя Alexey, то получится прямоугольник, в котором каждая строка содержит 8 символов (включая символы по краям):

%%%%%%%%
%Alexey%
%%%%%%%%

using System;

class Program
{
    static void Main()
    {
        // Запрос символа для создания прямоугольника
        Console.Write("Введите символ для создания прямоугольника: ");
        char rectangleSymbol = Console.ReadKey().KeyChar;
        Console.WriteLine(); // Переход на новую строку после ввода символа

        // Запрос имени
        Console.Write("Введите имя для отображения: ");
        string userName = Console.ReadLine();

        // Определяем длину строки для прямоугольника
        int rectangleWidth = userName.Length + 2; // Длина имени + 2 для символов по краям

        // Вывод верхней границы прямоугольника
        Console.WriteLine(new string(rectangleSymbol, rectangleWidth));

        // Вывод имени в прямоугольнике
        Console.WriteLine($"{rectangleSymbol}{userName}{rectangleSymbol}");

        // Вывод нижней границы прямоугольника
        Console.WriteLine(new string(rectangleSymbol, rectangleWidth));
    }
}
