// Напишите программу, которая отображает имя в прямоугольнике из символов, выбранных пользователем.
// Программа должна запрашивать у пользователя символ для создания прямоугольника и само имя, которое нужно отобразить внутри этого прямоугольника. Затем выводите имя в прямоугольнике из указанного символа.
// Длина всех строк в прямоугольнике должна быть одинаковой. Чтобы определить эту длину, можно использовать длину строки, содержащей имя, плюс две дополнительные позиции для символов по краям. Например, если пользователь вводит символ % и имя Alexey, то получится прямоугольник, в котором каждая строка содержит 8 символов (включая символы по краям):

%%%%%%%%
%Alexey%
%%%%%%%%

using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите символ для создания прямоугольника: ");
        char rectangleSymbol = Console.ReadKey().KeyChar;
        Console.WriteLine(); 

        Console.Write("Введите имя для отображения: ");
        string userName = Console.ReadLine();

        int rectangleWidth = userName.Length + 2; 

        Console.WriteLine(new string(rectangleSymbol, rectangleWidth));

        Console.WriteLine($"{rectangleSymbol}{userName}{rectangleSymbol}");

        Console.WriteLine(new string(rectangleSymbol, rectangleWidth));
    }
}
